apache/nuttx/arch/arm/src/stm32f7/stm32f76xx77xx_rcc.c
  modifyreg32(STM32_DBGMCU_CR, DBGMCU_CR_TRACEMODE_MASK,
              DBGMCU_CR_ASYNCH | DBGMCU_CR_TRACEIOEN);
}
#else
#  define rcc_itm_syslog()
#endif

/****************************************************************************
 * Name: rcc_enableperiphals
 ****************************************************************************/

static inline void rcc_enableperipherals(void)
{
  rcc_enableahb1();
  rcc_enableahb2();
  rcc_enableahb3();
  rcc_enableapb1();
  rcc_enableapb2();
  rcc_itm_syslog();
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: stm32_rcc_dsisrcphy
 *
 * Description:
 *   Set DSI clock source to DSI PHY
 *
 ****************************************************************************/

void stm32_rcc_dsisrcphy(void)
{
  uint32_t regval;
  regval  = getreg32(STM32_RCC_DCKCFGR2);
  regval &= ~(RCC_DCKCFGR2_DSISEL_MASK);

  regval |= (RCC_DCKCFGR2_DSISEL_PHY);
  putreg32(regval, STM32_RCC_DCKCFGR2);
}

/****************************************************************************
 * Name: stm32_rcc_dsisrcpllr
 *
 * Description:
 *   Set DSI clock source to PLLR
 *
 ****************************************************************************/

void stm32_rcc_dsisrcpllr(void)
{
  uint32_t regval;
  regval  = getreg32(STM32_RCC_DCKCFGR2);
  regval &= ~RCC_DCKCFGR2_DSISEL_MASK;

  regval |= RCC_DCKCFGR2_DSISEL_SYSCLK;
  putreg32(regval, STM32_RCC_DCKCFGR2);
}
